Revit 2026 API

# ParameterTypeIdStairsRunCreateAutoLanding Property

---

"With Automatic Landing": Create automatic landing

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ForgeTypeId StairsRunCreateAutoLanding { get; }
```
```vb
Public Shared ReadOnly Property StairsRunCreateAutoLanding As ForgeTypeId
	Get
```
```cpp
public:
static property ForgeTypeId^ StairsRunCreateAutoLanding {
	ForgeTypeId^ get ();
}
```
```fsharp
static member StairsRunCreateAutoLanding : ForgeTypeId with get
```

#### Property Value

ForgeTypeId

#### Reference

ParameterTypeId Class

Autodesk.Revit.DB Namespace